site/app/controllers/caller_ids_controller.rb

  def show
    @caller_id = CallerId.find(params[:id])
---
SELECT * FROM "caller_ids" WHERE ("caller_ids"."id" = 1)

  def edit
    @caller_id = CallerId.find(params[:id])
---
SELECT * FROM "caller_ids" WHERE ("caller_ids"."id" = 1)

  def create
    @caller_id = CallerId.new(params[:caller_id])

    respond_to do |format|
      if @caller_id.save
---
INSERT INTO "caller_ids" ("updated_at", "description", "did", "created_at") VALUES('2009-02-04 02:09:48', '(214) 693-5115', '2146935115', '2009-02-04 02:09:48')

  def update
    @caller_id = CallerId.find(params[:id])

    respond_to do |format|
      if @caller_id.update_attributes(params[:caller_id])
---
SELECT * FROM "caller_ids" WHERE ("caller_ids"."id" = 1)
UPDATE "caller_ids" SET "did" = '2146935115', "description" = '(214) 693-5115', "updated_at" = '2009-02-04 02:10:21' WHERE "id" = 1