site/app/controllers/route_rules_controller.rb

  def show
    @route_rule = RouteRule.find(params[:id])
---
SELECT * FROM "route_rules" WHERE ("route_rules"."id" = 1)

  def edit
    @route_rule = RouteRule.find(params[:id])
---
SELECT * FROM "route_rules" WHERE ("route_rules"."id" = 1)

  def create
    @route_rule = RouteRule.new(params[:route_rule])

    respond_to do |format|
      if @route_rule.save
---
INSERT INTO "route_rules" ("updated_at", "url", "did", "created_at") VALUES('2009-02-04 01:17:36', 'http://www.konectas.com/calls/inbound_start', '2146935115', '2009-02-04 01:17:36')

  def update
    @route_rule = RouteRule.find(params[:id])
---
SELECT * FROM "route_rules" WHERE ("route_rules"."id" = 1)